fdr/src/test/resources/mocks/pspNotifyPayment/OK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:psp="http://pagopa-api.pagopa.gov.it/psp/pspForNode.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <psp:pspNotifyPaymentRes>
            <outcome>OK</outcome>
        </psp:pspNotifyPaymentRes>
    </soapenv:Body>
</soapenv:Envelope>